export const footerIcons: ELink[] = [
    {
      title: 'fb',
      to: 'https://www.facebook.com/egistickz/',
    },
    {
      title: 'insta',
      to: 'https://www.instagram.com/egistic.kz/',
    },
    {
      title: 'tele',
      to: 'https://t.me/egistickz',
    },
    {
      title: 'whatsapp',
      to: 'https://wa.me/77029774926',
    },
];

export const navItems1: ELink[] = [
    {
      title: 'О нас',
      to: '/someRoute',
    },
    {
      title: 'Услуги',
      to: '/someRoute',
    },
    {
      title: 'Новости',
      to: '/someRoute',
    },
];

export const navItems2: ELink[] = [
    {
      title: 'Инструкции для пользователя',
      to: '/',
    },
    {
      title: 'Часто задаваемые вопросы',
      to: '/',
    },
];

export const sticks: Info[] = [
    {
        title: 'Зарегистрируйтесь',
        details: 'Пройдите регистрацию с помощью Вашей электронной почты. Введите кадастровый номер Вашего поля или загрузите границы Ваших полей. Получите 14 дней бесплатного пользования.',
    },
    {
        title: 'Купите подписку',
        details: 'Годовая подписка стоимостью 30 тенге за 1 га. Получайте обработанные космические снимки Ваших полей каждые 3- 5 дней по индексам вегетации, влажности, азота и хлорофилла поверхности почвы и в листьях растений.',
    },
    {
        title: 'Анализируйте',
        details: 'Годовая подписка стоимостью 30 тенге за 1 га. Получайте обработанные космические снимки Ваших полей каждые 3- 5 дней по индексам вегетации, влажности, азота и хлорофилла поверхности почвы и в листьях растений.',
    },
];

export const servicesCards: Info[] = [
    {
        title: 'satellite',
        details: 'Спутниковые снимки полей',
    },
    {
        title: 'before-after',
        details: 'Состояние посевов до и после',
    },
    {
        title: {
            icon: 'jusan',
            fill: true,
        },
        details: 'Планирование севооборота',
    },
    {
        title: {
            icon: 'telematics',
            fill: true,
        },
        details: 'Телематика: GPS мониторинг техники, уровень топлива, наполнение бункера',
    },
    {
        title: 'box-correct',
        details: 'Управление агромероприятиями',
    },
    {
        title: {
            icon: 'sun-clouds',
            fill: true,
            color: '#1C1C1C r-#1C1C1C',
        },
        details: 'Погода: прогноз на 9 дней вперед в радиусе 20 км',
    },
    {
        title: 'chemical-tube',
        details: 'Агрохим анализ почвы',
    },
    {
        title: {
            icon: 'analytics',
            fill: true,
            color: '#1C1C1C r-#1C1C1C',
        },
        details: 'Аналитика: засоренность, кривая вегетации, проблемные зоны',
    },
    {
        title: 'people',
        details: 'Подключение агро консультантов',
    },
    {
        title: 'farm',
        details: 'Агроскаутинг',
    },
];

export const faqs: QnA[] = [
    {
        question: 'Как начать работу?',
        answer: 'По вопросу: "Как начать работу?" Позвоните по номеру +7 702 977 4926.',
    },
    {
        question: 'Что дает анализ по космическим снимкам?',
        answer: 'По вопросу: "Что дает анализ по космическим снимкам?" Позвоните по номеру +7 702 977 4926.',
    },
    {
        question: 'Как проводить обследование полей?',
        answer: 'По вопросу: "Как проводить обследование полей?" Позвоните по номеру +7 702 977 4926.',
    },
    {
        question: 'Агросопровождение для производителей семян и дистрибьюторов СЗР, семян и агрохим лабораторий',
        answer: 'По вопросу: "Агросопровождение для производителей семян и дистрибьюторов СЗР, семян и агрохим лабораторий" Позвоните по номеру +7 702 977 4926.',
    },
];

export const feedbacks: Feedback[] = [
    {
        user: {
            username: 'Арман Омаров',
            avatar: 'https://source.unsplash.com/900x900/?person',
            jobTitle: 'Агроном',
        },
        feedback: '“Пользуюсь Egistic уже 1 год. Очень удобный сайт и много возможностей.”',
    },
    {
        user: {
            username: 'Азамат Оспанов',
            avatar: 'https://source.unsplash.com/900x900/?person',
            jobTitle: 'Директор агрохолдинга',
        },
        feedback: '“Благодаря этому сервису могу получить анализ почвы своих хозяйств и найти нужные решения.”',
    },
    {
        user: {
            username: 'Тамерлан Абдыгалиев',
            avatar: 'https://source.unsplash.com/900x900/?person',
            jobTitle: 'Владелец 5-и хозяйств',
        },
        feedback: '“Следить за всеми хозяйствами и работниками с любой точки мира стало намного удобней с Egistic.”',
    },
    {
        user: {
            username: 'Алексей Смирнов',
            avatar: 'https://source.unsplash.com/900x900/?person',
            jobTitle: 'Менеджер хозяйства',
        },
        feedback: '“Широкий функционал позволяет следить не только за хозяйством, но и управлять ресурсами.”',
    },
    {
        user: {
            username: 'Азамат Оспанов',
            avatar: 'https://source.unsplash.com/900x900/?person',
            jobTitle: 'Директор агрохолдинга',
        },
        feedback: '“Благодаря этому сервису могу получить анализ почвы своих хозяйств и найти нужные решения.”',
    },
];
